Tekla.Structures.Drawing.LeaderLineAndParentObjectAlongPartPlacingType
The LeaderLineAndParentObjectAlongPartPlacingType class defines a placing type that places
the object with a leader line and rotated to be at the same angle as the connected part.

Tekla.Structures.Drawing.LeaderLineAndParentObjectAlongPartPlacingType.#ctor
Creates a new leader line and parent object along part placing type instance.